---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsOnPanel
source: html/592744db-773f-36e5-e5b6-63ec6fab970d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsOnPanel Property

You can't change the connection type to Breakers connect to panel [Panel Name] because there aren't enough slots. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or open the panel schedule and manually reshuffle non - consecutive slots.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughAvailSlotsOnPanel { get; }
```